{
  "description": "10. VIP Most Dangerous Game\r\n\r\nVIP Most Dangerous Game pits a hunter against a hunted in a maze.  The hunter must\r\nshoot the hunted before either time runs out or the hunted escapes the maze.\r\nHowever, neither the hunted nor the hunter can see a wall in the maze until he runs\r\ninto it.  There is always at least one path through the maze.\r\n\r\nHow To Play VIP Most Dangerous Game\r\n\r\n1. Load the CHIP-8 interpretor at 0000-01FF\r\n   and the game starting at 0200.\r\n\r\n2. Turn RUN switch on.\r\n\r\n3. Hunted's turn:\r\n   When the arrow appears in the lower left, it is the hunted's turn.  Keys 2-4-6-8\r\n   control direction (up-left-right-down, respectively).  The hunted continues to\r\n   move until a) he makes 5 moves, b) he hits a wall or c) key 0 is pressed.\r\n\r\n4. Hunter's turn\r\n   When the arrow appears in the lower right, it is the hunter's turn.  The hunter's\r\n   turn consists of two modes, the move and the shoot.  Keys 2-4-6-8 and 0 control both\r\n   modes.  Like the hunted, the hunter continues to move until a) he makes 3 moves,\r\n   b) he hits a wall or c) key 0 is pressed.  If he hits the wall, case b), he cannot\r\n   fire a bullet.  The hunter may fire one of his bullets using the direction keys\r\n   2-4-6-8.  The bullet will travel four squares in the corresponding direction, unless\r\n   a wall is encountered.  If the hunter prefers not to use a bullet, he must press key 0.\r\n\r\n5. Repeat steps 3 and 4 until:\r\n   a) The number of turns (upper left on the display) expire.  The hunted wins.\r\n   b) The hunter lands on or shoots the hunted.  The hunter wins.\r\n   c) The hunted lands on hunter, thereby giving up.  The hunter wins.\r\n   d) The hunted reaches the lower right corner of the maze with at least 1 move\r\n      remaining in his turn.  The hunted wins, by escaping the maze.\r\n\r\n6. Variations of VIP Most Dangerous Game may be played by changing certain bytes in\r\n   the program.\r\n\r\nLocation Default Meaning\r\n0215\t 0F\t Number of turns in the game.\r\n0217\t 06\t Number of bullets hunter has at start.\r\n0219\t 03\t Number of moves per turn for the hunter.\r\n0221\t 01\t Number of squares per move (hunted and hunter).\r\n022B\t 05\t Number of moves per turn for the hunted.\r\n024B\t 01\t If zero, walls are invisible.\r\n0355\t 04\t Number of squares a bullet will go.\r\n04E3\t 70\t Probability (out of 100Hex) of a wall appearing.\r\n04EB\t FE\t If FF, a wall may appear at previously tested boundaries.\r\n"
}