{
  "description": "8.  VIP DEFLECTION\r\n\r\nIn the VIP Deflection game you position mirrors anywhere on the display screen.\r\nThe object of the game is to deflect a ball of the mirrors a maximum number of\r\ntimes before hitting the target.\r\n\r\nThe number of deflections times the target number gives you deflection points.\r\nThese are added to your previous point total.  If you fail to hit the target you\r\nget no points.  The winner of the game is the player who accumulates 257 or\r\nmore deflected points.\r\n\r\nHow to Play VIP Deflection\r\n\r\n1. Load the CHIP-8 interpretor at 0000-01FF\r\n   and the game starting at 0200.\r\n\r\n2. Turn RUN switch on.\r\n\r\n3. After the scores appear a letter, the target with a number and a ball.  The\r\n   letter signifies the player who will program the mirrors.  This sequence will\r\n   be repeated until there is a winner.\r\n\r\n4. To program the mirrors, select the proper mirror type by using Table 1 (VIP1-8.jpg)\r\n   as a guide.  Key 1 will place a horizontal mirror on the board.  Key 2 selects a\r\n   vertical mirror, Key 3 a slant-left mirror, Key 4 a slant-right mirror.\r\n\r\n5. After a mirror has been selected, you may position the mirror by using keys 1\r\n   through 4 and 6 through 9 (see Table 2 for movement of a mirror).  Once a\r\n   mirror has been selected and positioned, it may be fixed into position by pressing\r\n   Key 5.\r\n\r\n   Table 2 - Mirror Positioning and Ball Direction\r\n   Key Selection     |  Positioning and Direction\r\n   ------------------+---------------------------\r\n         1           |  up and to the left\r\n         2           |  up\r\n         3           |  up and to the right\r\n         4           |  left\r\n         5           |  right\r\n         7           |  down and to the left\r\n         8           |  down\r\n         9           |  down and to the right\r\n\r\n6. You may position up to 10 mirrors on the game board.  After you have the maximum\r\n   amount on the board you must press Key 0 to progress to the fire mode.  If you\r\n   wish to progress to the fire mode with less than 10 mirrors programmed, you may\r\n   do so by pressing Key 0.  You fire the ball in the direction you want by using\r\n   Keys 1 through 4 and Keys 6 through 9 (see Table 2).\r\n\r\n7. After the ball has reached the target or leaves the game board, the player's\r\n   score is computed and displayed and a new ball and target appear.\r\n\r\n\r\n\r\n"
}