{
  "description": "14. VIP Programmable Spacefighters\r\n\r\nProgrammable Spacefighters is a combat game involving 2 to 8 spaceships competing\r\nfor the domination of a contained field in space.  The field of play is a \r\ntwo-dimensional representation of an oblong spheroid.\r\n\r\nThe movement and fire of each spacefighter is controlled by programming a series of\r\ncommands into each fighter's instruction storage table.  Once all the spacefighters\r\nare programmed, they carry out their commands by sequentially executing a single step\r\nat a time.  The play of the game ins divided into rounds.  Each spacefighter may\r\nexecute between 1 and 15 commands per round.\r\n\r\nThe fighters all have the same appearance and capabilities.  Players distinguish\r\nbetween fighters by examining the defense strength and position of their fighters\r\nat the begining of every round.\r\n\r\nEach fighter may face in any of 8 directions.  All firing and forward movement\r\noccurs in the direction the fighter is currently facing.  As a spacefighter crosses\r\noutside the two-dimensional field of play, it wraps around and re-enters on the\r\nopposite side of the field.  Laser bursts terminate when they travel outside the\r\nfield or hit a target.\r\n\r\nEach round consists of a selected number of steps.  Each step is executed in 2 parts.\r\nDuring the first part, every spacefighter wishing to fire may execute a fire operation.\r\nThe defense strength of any fighter which is hit by a laser burst is reduced by 1\r\nand a small flash appears.\r\n\r\nAfter all fighters have had an opportunity to execute fire instructions, the movement\r\npart of the step begins.  Any fighter which has had its defense strength reduced to 0\r\nis destroyed and a longer flash appears.  The defense strength is changed to a special\r\ncode so that the fighter will no longer be programmable or take part in the execution\r\nphase.  The destroyed fighter will still be open to examination during the Defense/\r\nPosition Check phase.  Fighers having a defense strength greater than 0 may execute\r\na movement command if there is one.  Breaking each step into 2 such parts removes any\r\nstrategic advantage to moving first.\r\n\r\nThe nature of the game, in that there are variable parameters and no fixed victory\r\nconditions, allows the players a lot of freedom.  Two to eight players can command\r\nsingle fighters.  Four or less players can each command multiple fighters.  Two\r\nfleets could complete to destroy their opponents' flagship first.  Handicaps can\r\nbe implemented through an imbalance of fighters in different fleets.  An odd number\r\nof players can play in a free for all or team game.  In a non-combat approach, a full\r\ncomplement of space fighters could be programmed to preform in kaleidoscope or other\r\ntype formations.\r\n\r\n\r\nHow to Play VIP Programmable Spacefighters\r\n\r\n1. Load the CHIP-8 interpreter at 0000-01FF and\r\n   the game starting at 0200.\r\n\r\n2. Turn RUN switch on.\r\n\r\n3. Initalization of Game.\r\n   Various parameters are entered at the start of the game to determine the number\r\n   of spacefighters and other aspects of play.\r\n\r\n   S: Enter number of spacefighters.  1 to 8 spacefighters may be used.  The program\r\n      will adjust invalid enteries to the nearest valid number.\r\n\r\n   D: Enter defense strength.  A spacefighter may be hit from 1 to F times by laser\r\n      before being destroyed.\r\n\r\n   E: Enter number of command entries.  A spacefighter may be programmed with 1 to F\r\n      commands during the programming phase of each round.\r\n\r\n   C: Enter clock duration/no clock.  A timer clock 1 to F phorseks in duration may\r\n      be selected.  Each phorsek equals 4 seconds.  The clock is not enabled if a 0\r\n      is entered.  The clock time is the time allowed for each fighter to be set up.\r\n\r\n   F: Enter fire power available.  A spacefighter may be allowed to fire 1 to F\r\n      laser bursts per round.\r\n\r\n   A: Enter accumulation/no accumulation.  A spacefighter may be allowed to accumulate\r\n      all unused laser bursts by entering 1 to F.  Accumulation is not allowed if a\r\n      0 is entered.\r\n\r\n4. Presentation of Field and Spacefighters.\r\n   The two-dimensional representation of the palying fields consists of 10 vertical\r\n   by 15 horizontal positons indicated by grid markings around the perimeter.  The\r\n   spacefighters will be in their initial positions.\r\n\r\n5. Defense/Position Check.\r\n     Enter number of spacefighter to be examined.\r\n     S: Current spacefighter being examined.\r\n     D: Defense strength of current spacefighter.\r\n     Enter 0 to end defense/position check phase.\r\n\r\n6. Program Spacefighters.\r\n   Surviving spacefighters are programmed in ascending order.  Enter 0 to begin\r\n   programming first spacefighter.  Defense strength and position are shown during\r\n   programming.\r\n     E: indicates number of enteries left after current command.\r\n     C: indicates time remaining to program current fighter if clock was entered.\r\n\r\n    COMMAND   FUNCTION\r\n      1        Rotate 45 ccw, Move fwd\r\n      2        Move fwd\r\n      3        Rotate 45 cw, Move fwd\r\n      4        Rotate 45 ccw\r\n      5        Fire\r\n      6        Rotate 45 cw\r\n      B        Erase all commands and reprogram current spacefighter\r\n      E        End programming of current spacefighter\r\n      7-A,C,D,F  Rest, No operation\r\n      0        Rest, Begin programming next spacefighter\r\n\r\n   Enter 0 to begin programming each successive spacefighter.\r\n\r\n7. Execute Commands.\r\n   Enter 0 after all spacefighters are programmed to start execution of commands.\r\n\r\n8. The recommended starting point when tryint the game out is with 1 or 2 spacefighters,\r\n   any defense, F (15) entries per round, no clock, F (15) fire power and any accumulation\r\n      S: 1 or 2\r\n      D: 1\r\n      E: F\r\n      C: 0\r\n      F: F\r\n      A: 0\r\n\r\n   Use the above to try out the movement and fire execution of the fighters.  Try\r\n   performing loops, figure 8's, tight turns, maximum fire coverage techniques, etc.\r\n   Start out simple when first playing the game against an opponent.  \r\n   Eight spacefighters can get very complicated.\r\n\r\n9. Changing different parameters creates very different effects on the play of the game.\r\n   The main effect of a large number of fighters is a more complicated game.  A large\r\n   number of enteries per round results in a more lively game involving farsighted\r\n   planning.  Fewer enteries involves more thinking and reacting to immediate developments\r\n   but is not without strategy when there are multiple fighters opposing each other.\r\n   The clock provides pressure which can be greatly increased by the moves-to-time ratio.\r\n   More fire power increases the importance of movement and positioning.  Accumulation\r\n   of fire power can have long range effects if there is low fire power and a large\r\n   number of moves per round.\r\n"
}