{
  "description": "6. VIP REVERSI\r\nReversi is a game over 100 years old, which has become popular recently under the\r\nname Othello.  The game is played on a 8x8 square, using two kinds of markers.\r\nIn VIP Reversi one player has the open markers and the other player the solid\r\nmarkers.  The score for either player at any time is the total number of his markers\r\non the square.\r\n\r\nHow to play VIP Reversi\r\n\r\n1. Load the CHIP-8 interpretor at 0000-01FF\r\n   and the game starting at 0200.\r\n\r\n2. Turn RUN switch on.\r\n\r\n3. The 8x8 square will be formed and the starting marker configuration shown, having\r\n   two of each kind of marker in the center four locations of the square.  The starting\r\n   score for each player is shown as 02 above a line of his markers.\r\n\r\n4. Your VIP indicates the player's turn by blinking that player's score and also blinking\r\n   a cursor dot in the 8x8 square.  A player moves the blinking cursor dot in the 8x8\r\n   square by pressing the direction keys 1-4 and 6-9 as shown. (VIPG1-6.JPG)\r\n\r\n5. When the cursor-dot is properly located, the player presses key 5 to place his marker\r\n   on the square.  You will find that your VIP will not allow you to make a non-valid\r\n   play.  The only placements allowed are onces for which at least one of the other\r\n   player's markers is surrounded between an existing marker of your own and your new\r\n   marker being placed.  All these markers must be in consecutive positions on the\r\n   square and can be in any horizontal, vertical or diagonal direction.  Once a new\r\n   marker has been placed, your VIP will change all such surrounded markers of the\r\n   other player to your kind and change the scores.\r\n\r\n6. Sometimes it may not be possible for a player to make a valid move.  If this happens\r\n   he must forfeit his move by pressing the \"F\" key! The game ends when neither player\r\n   can play or when the 8x8 square is completely filled with markers.  The goal is to\r\n   end the game with the highest score.  Do not be discouraged if during the game you\r\n   seem to be losing because this is a game with dramatic reversals!  Develop a winning\r\n   strategem and become a champion!!\r\n"
}